{
 "version" : 1,
 "answer_list" : [
   {
     "answer" : "9993883399922",
     "response" : "Correct. Those are the correct values for row 1 of the Filomino."
   },
   {
     "answer" : "9993883999944",
     "response" : "Correct. Those are the correct values for row 2 of the Filomino."
   },
   {
     "answer" : "9993888899445",
     "response" : "Correct. Those are the correct values for row 3 of the Filomino."
   },
   {
     "answer" : "77101010101010102555",
     "response" : "Correct. Those are the correct values for row 4 of the Filomino."
   },
   {
     "answer" : "3777771010102522",
     "response" : "Correct. Those are the correct values for row 5 of the Filomino."
   },
   {
     "answer" : "3388888888333",
     "response" : "Correct. Those are the correct values for row 6 of the Filomino."
   },
   {
     "answer" : "7710101010101055555",
     "response" : "Correct. Those are the correct values for row 7 of the Filomino."
   },
   {
     "answer" : "577777101033366",
     "response" : "Correct. Those are the correct values for row 9 of the Filomino."
   },
   {
     "answer" : "534444101072261",
     "response" : "Correct. Those are the correct values for row 10 of the Filomino."
   },
   {
     "answer" : "5377772273363",
     "response" : "Correct. Those are the correct values for row 11 of the Filomino."
   },
   {
     "answer" : "5372335577363",
     "response" : "Correct. Those are the correct values for row 12 of the Filomino."
   },
   {
     "answer" : "5772355577763",
     "response" : "Correct. Those are the correct values for row 13 of the Filomino."
   },
   {
     "answer" : "GGGGGGWWWWGWG",
     "response" : "Correct. Those are the correct values for row 1 of the Inverse Akari."
   },
   {
     "answer" : "GWWWWGWWWWGWG",
     "response" : "Correct. Those are the correct values for row 2 of the Inverse Akari."
   },
   {
     "answer" : "GGGWWGWWWWWWG",
     "response" : "Correct. Those are the correct values for row 3 of the Inverse Akari."
   },
   {
     "answer" : "WWWWWWWWWWWWW",
     "response" : "Correct. Those are the correct values for rows 4, 6, 8, 9, 11, 12 and 13 of the Inverse Akari."
   },
   {
     "answer" : "GGGGGWWWWWWWW",
     "response" : "Correct. Those are the correct values for rows 5 and 7 of the Inverse Akari."
   },
   {
     "answer" : "GGGGGGWWWWWWW",
     "response" : "Correct. Those are the correct values for row 10 of the Inverse Akari."
   },
   {
     "answer" : "GGGGGGGGGGWB",
     "response" : "Correct. Those are the correct values for row 1 of the Nonogram."
   },
   {
     "answer" : "WWWWWGWWGBBB",
     "response" : "Correct. Those are the correct values for row 2 of the Nonogram."
   },
   {
     "answer" : "GGBBGBWGBGBG",
     "response" : "Correct. Those are the correct values for row 3 of the Nonogram."
   },
   {
     "answer" : "GBGWBGBBGGGG",
     "response" : "Correct. Those are the correct values for row 4 of the Nonogram."
   },
   {
     "answer" : "BGWWGGWGGGGG",
     "response" : "Correct. Those are the correct values for rows 5 and 6 of the Nonogram."
   },
   {
     "answer" : "BGGWGGWGGGGG",
     "response" : "Correct. Those are the correct values for rows 7 and 8 of the Nonogram."
   },
   {
     "answer" : "GGGGGGGGGGGG",
     "response" : "Correct. Those are the correct values for row 9 of the Nonogram."
   },
   {
     "answer" : "WGGWGWWGGGWG",
     "response" : "Correct. Those are the correct values for row 10 of the Nonogram."
   },
   {
     "answer" : "WGGWGWWGWGWG",
     "response" : "Correct. Those are the correct values for row 11 of the Nonogram."
   },
   {
     "answer" : "WGGWGWWWWGWG",
     "response" : "Correct. Those are the correct values for row 12 of the Nonogram."
   },
   {
     "answer" : "TNNTNTTTNNMT",
     "response" : "Correct. Those are the correct values for row 1 of Minesweeper+."
   },
   {
     "answer" : "TNNTNTTTTMTT",
     "response" : "Correct. Those are the correct values for row 2 of Minesweeper+."
   },
   {
     "answer" : "TNNTNTTTMTTT",
     "response" : "Correct. Those are the correct values for row 3 of Minesweeper+."
   },
   {
     "answer" : "TNNTNMMMNNNN",
     "response" : "Correct. Those are the correct values for rows 4 and 6 of Minesweeper+."
   },
   {
     "answer" : "TNTTMTTTTTTT",
     "response" : "Correct. Those are the correct values for row 5 of Minesweeper+."
   },
   {
     "answer" : "TNNTTTTMTTTT",
     "response" : "Correct. Those are the correct values for row 7 of Minesweeper+."
   },
   {
     "answer" : "TNNTTTTMTTNN",
     "response" : "Correct. Those are the correct values for row 8 of Minesweeper+."
   },
   {
     "answer" : "TNNTTTMTTTTT",
     "response" : "Correct. Those are the correct values for row 9 of Minesweeper+."
   },
   {
     "answer" : "TNNTNMTTTTTT",
     "response" : "Correct. Those are the correct values for row 10 of Minesweeper+."
   },
   {
     "answer" : "TNNTMTTTTTTT",
     "response" : "Correct. Those are the correct values for row 11 of Minesweeper+."
   },
   {
     "answer" : "TMMMNNNNNNNN",
     "response" : "Correct. Those are the correct values for row 12 of Minesweeper+."
   },
   {
     "answer" : "MTMTTTTNNNNN",
     "response" : "Correct. Those are the correct values for row 13 of Minesweeper+."
   },
   {
   "answer" : "movable promulgator",
    "correct" : true,
    "canonical" : true
    }
    ],
    "hints" : [
      {
       "time" :  60,
       "id" : "wtf1",
       "text" : "You can work on WTF part 1 and part 2 independently, but you'll need both parts to get the final answer. If you've never seen these logic puzzles before, checkout nikoli.com."
      },
      {
       "time" : 300,
       "id" : "wtf2",
       "text" : "The logic puzzles don't form a cohesive picture, just a pattern of boxes in white, grey and blue.  It should look kind of familiar, however.  You can verify any row in any logic puzzle by entering it into the app, by digit for the Filomino, by color (g, w or b) for the Nonogram and the Inverse Akari and by fill (m, t or n) for Minesweeper+."
      },
      {
       "time" : 600,
       "id" : "wtf3",
       "text" : "WTF: What the F*(&, the phrases are in alphabetic order."
      },
      {
       "time" : 1800,
       "id" : "wtf5",
       "text" : "Match the logic puzzle grids from Who To Follow to the grid in What the F*(&, the dark blue squares should give you path through the grid with a message that starts with \"THE ANSWER IS\" "
      }
      ]
}